; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj5 - airport
	obj1 obj6 - city
	obj2 obj3 obj4 obj9 obj13 - airplane
	obj7 obj11 obj12 - truck
	obj8 obj10 obj15 - package
	obj14 obj16 - location
)

(:init
	(at obj12 obj0)
	(at obj15 obj14)
	(in-city obj14 obj6)
	(at obj7 obj0)
	(at obj3 obj0)
	(at obj9 obj5)
	(in-city obj16 obj1)
	(at obj2 obj0)
	(at obj8 obj5)
	(in-city obj5 obj6)
	(at obj10 obj0)
	(at obj13 obj0)
	(at obj4 obj0)
	(at obj11 obj5)
	(in-city obj0 obj1)
)

(:goal (and
	(at obj8 obj0)
	(at obj10 obj5)
	(at obj15 obj0)
))
)

; plan
1. (load obj9 obj8 obj5)
   deleted: (at obj8 obj5)
   added: (in obj8 obj9)
   goals met: 0 of 3
2. (fly obj9 obj5 obj0)
   deleted: (at obj9 obj5)
   added: (at obj9 obj0)
   goals met: 0 of 3
3. (unload obj9 obj8 obj0)
   deleted: (in obj8 obj9)
   added: (at obj8 obj0)
   goals met: 1 of 3
4. (load obj9 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj9)
   goals met: 1 of 3
5. (fly obj9 obj0 obj5)
   deleted: (at obj9 obj0)
   added: (at obj9 obj5)
   goals met: 1 of 3
6. (unload obj9 obj10 obj5)
   deleted: (in obj10 obj9)
   added: (at obj10 obj5)
   goals met: 2 of 3
7. (drive obj11 obj5 obj14)
   deleted: (at obj11 obj5)
   added: (at obj11 obj14)
   goals met: 2 of 3
8. (load obj11 obj15 obj14)
   deleted: (at obj15 obj14)
   added: (in obj15 obj11)
   goals met: 2 of 3
9. (drive obj11 obj14 obj5)
   deleted: (at obj11 obj14)
   added: (at obj11 obj5)
   goals met: 2 of 3
10. (unload obj11 obj15 obj5)
   deleted: (in obj15 obj11)
   added: (at obj15 obj5)
   goals met: 2 of 3
11. (load obj9 obj15 obj5)
   deleted: (at obj15 obj5)
   added: (in obj15 obj9)
   goals met: 2 of 3
12. (fly obj9 obj5 obj0)
   deleted: (at obj9 obj5)
   added: (at obj9 obj0)
   goals met: 2 of 3
13. (unload obj9 obj15 obj0)
   deleted: (in obj15 obj9)
   added: (at obj15 obj0)
   goals met: 3 of 3
